{
  "backend/main.mo": "Main backend actor implementing video management (CRUD with YouTube URL validation, genre support, and admin-only access) and user profile management with role-based authorization using AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removal of logo box from SplashView and TopNav components, with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, utilities, and configuration files for the Netflix-style streaming application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a cinematic dark theme with custom sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title \"TV Streaming Network\", and root div mounting the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component managing view state (splash/home/manage), session-based splash dismissal, admin access control with toast notifications, and conditional TopNav rendering with footer.",
  "frontend/src/components/auth/AdminAuthControls.tsx": "Admin authentication controls displaying \"Admin Sign In\" button or \"Clear Admin Access\" based on admin status, with dialog trigger and success callback for post-authentication navigation.",
  "frontend/src/components/auth/AdminTokenDialog.tsx": "Modal dialog for admin authentication that validates admin code input, displays clear error messages for invalid codes, and triggers success callback only after confirming admin status is true.",
  "frontend/src/components/auth/UserAuthButton.tsx": "User authentication button handling Internet Identity sign-in/sign-out with loading states and query cache clearing on logout.",
  "frontend/src/components/home/Hero.tsx": "Hero section component with background image, gradient overlays, and a call-to-action button that triggers the onExplore callback to scroll to video content.",
  "frontend/src/components/home/HomeView.tsx": "Main home view that displays the hero section and organizes videos into rows by category (Originals, Comedy, Drama, Documentary) with loading states and error handling.",
  "frontend/src/components/layout/TopNav.tsx": "Sticky top navigation bar with Home/Manage navigation buttons, user authentication controls, and admin authentication controls that conditionally render based on admin status.",
  "frontend/src/components/manage/ManageVideosView.tsx": "Admin-only video management dashboard that checks admin permissions and displays a list of videos with add/edit/delete functionality, showing access denied for non-admin users.",
  "frontend/src/components/manage/VideoForm.tsx": "Form component for creating and editing videos with fields for title, description, YouTube URL, genre, and original status, including URL validation and mutation handling.",
  "frontend/src/components/manage/VideoListItem.tsx": "List item component displaying video thumbnail and metadata with edit/delete action buttons and a confirmation dialog for deletion.",
  "frontend/src/components/splash/SplashView.tsx": "Full-screen splash screen with animated background elements, large title, and an enter button that triggers the onContinue callback.",
  "frontend/src/components/videos/VideoCard.tsx": "Video card component displaying thumbnail with hover effects and play button overlay that opens a video player dialog on click.",
  "frontend/src/components/videos/VideoPlayerDialog.tsx": "Modal dialog component that embeds a YouTube video player with autoplay using the video's YouTube ID and displays title and description.",
  "frontend/src/components/videos/VideoRow.tsx": "Displays a horizontal scrollable row of video cards with a title and left/right navigation buttons that appear on hover.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides a hook to check if the current user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useAdminToken.ts": "Manages admin token application and removal, storing tokens in sessionStorage and triggering actor/admin state re-evaluation through query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useVideos.ts": "Provides React Query hooks for fetching videos and original shows, plus mutations for creating, updating, and deleting videos with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme colors and a utility class to hide scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, managing sessionStorage persistence, and clearing sensitive parameters from URLs.",
  "frontend/src/utils/youtube.ts": "Parses YouTube URLs (watch, youtu.be, embed formats) to extract video IDs and generates thumbnail URLs with configurable quality levels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system, custom fonts (Inter, Outfit), animations (accordion, fade-in), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking completed features for removing logo box displays from SplashView and App components, with one pending feature request (AR-1) for the same logo removal task."
}