{
  "backend/main.mo": "Motoko canister managing user profiles and admin-gated video CRUD with URL validation and public read queries.",
  "feature_evidence.json": "Feature evidence report mapping splash-page-related features to frontend files and component versions.",
  "frontend-file-summaries.txt": "JSON map summarizing all frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and dark theme variables.",
  "frontend/index.html": "HTML entry point mounting the app root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing splash/home/manage views, admin gating, navigation, and layout rendering.",
  "frontend/src/components/auth/AdminAuthControls.tsx": "UI controls for admin sign-in and clearing admin access, integrating state checks and dialog handling.",
  "frontend/src/components/auth/AdminTokenDialog.tsx": "Modal dialog for entering and validating admin tokens with error handling and success callbacks.",
  "frontend/src/components/auth/UserAuthButton.tsx": "Provides a sign‑in/sign‑out button using Internet Identity, handling login state, errors, and clearing cached queries.",
  "frontend/src/components/home/Hero.tsx": "Displays the homepage hero section with background image, heading, description, and an Explore button.",
  "frontend/src/components/home/HomeView.tsx": "Renders the homepage with hero section and genre‑grouped video rows, handling loading, errors, and empty states.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing branding, navigation buttons, user auth, and admin controls based on permissions.",
  "frontend/src/components/manage/ManageVideosView.tsx": "Admin‑only video management page that lists videos, shows loading/error states, and opens the add/edit form.",
  "frontend/src/components/manage/VideoForm.tsx": "Form for creating or editing videos, including validation, YouTube URL parsing, and mutation submission.",
  "frontend/src/components/manage/VideoListItem.tsx": "Displays a video entry with thumbnail, metadata, edit and delete actions, and a confirmation dialog for deletion.",
  "frontend/src/components/splash/SplashView.tsx": "Intro splash screen with animated visuals, logo, title, and a button to continue into the app.",
  "frontend/src/components/videos/VideoCard.tsx": "Video thumbnail card that opens a video player dialog when clicked and shows basic video details.",
  "frontend/src/components/videos/VideoPlayerDialog.tsx": "Displays a dialog with video title, description, and an embedded YouTube iframe player.",
  "frontend/src/components/videos/VideoRow.tsx": "Renders a horizontally scrollable row of VideoCards with left/right navigation buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides a hook to check if the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useAdminToken.ts": "Manages session-based admin tokens, applying or clearing them and refreshing related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, storing identity and exposing login/logout state.",
  "frontend/src/hooks/useVideos.ts": "Provides hooks for listing, creating, updating, and deleting videos via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, and utility classes like scrollbar hiding.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/src/utils/youtube.ts": "Parses YouTube URLs to extract video IDs and generates thumbnail URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theming extensions, custom colors, animations, and enables typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current features, pending requests, and project state for the TV Streaming Network app."
}