{
  "backend/main.mo": "Motoko backend providing user profiles, admin-gated video CRUD, YouTube URL validation, and public video queries with AccessControl integration.",
  "feature_evidence.json": "Feature evidence report mapping admin-token and dashboard-UX features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including styles, components, and hooks.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark palettes and component styling tokens.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling view switching, admin gating, and automatic navigation after admin sign-in.",
  "frontend/src/components/auth/AdminAuthControls.tsx": "Admin auth UI that opens the token dialog, clears admin access, and triggers navigation after success.",
  "frontend/src/components/auth/AdminTokenDialog.tsx": "Dialog for entering and validating the admin token with error handling and success callbacks.",
  "frontend/src/components/auth/UserAuthButton.tsx": "Button for Internet Identity sign-in/out with loading state and react-query cache clearing on logout.",
  "frontend/src/components/home/Hero.tsx": "Displays the homepage hero section with background imagery and an Explore button triggering a scroll action.",
  "frontend/src/components/home/HomeView.tsx": "Fetches and displays grouped video content with loading, error, and empty states, including a hero section and video rows.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with logo, view navigation, user auth controls, and optional admin tools.",
  "frontend/src/components/manage/ManageVideosView.tsx": "Provides an admin-only interface to view, add, edit, and delete videos with loading and access control states.",
  "frontend/src/components/manage/VideoForm.tsx": "Form for creating or editing a video, including validation, YouTube URL parsing, and submit handling.",
  "frontend/src/components/manage/VideoListItem.tsx": "Displays a video entry with thumbnail, details, and edit/delete actions including a confirmation dialog for deletion.",
  "frontend/src/components/videos/VideoCard.tsx": "Shows an individual video thumbnail card that opens a player dialog when clicked.",
  "frontend/src/components/videos/VideoPlayerDialog.tsx": "Modal dialog that plays a YouTube video with title and description.",
  "frontend/src/components/videos/VideoRow.tsx": "Horizontal scrollable row of VideoCards with left/right scroll controls and a section title.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdmin.ts": "Checks whether the current actor has admin privileges using a react-query call.",
  "frontend/src/hooks/useAdminToken.ts": "Applies or clears an admin token, persists it, and invalidates related queries to refresh admin state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling authentication, stored identities, and login state.",
  "frontend/src/hooks/useVideos.ts": "Fetches videos and original shows and provides mutations for creating, updating, and deleting videos with query invalidation.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH variables for light and dark themes and utility classes like scrollbar hiding.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/youtube.ts": "Parses YouTube URLs to extract video IDs and generates thumbnail URLs.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color variables, fonts, animations, and plugins.",
  "project_state.json": "Stores the project’s current state, including admin-access issues, pending feature requests, and known problems with dashboard visibility. Contains metadata, architectural notes, and feature definitions for the TV Streaming Network app."
}