{
  "kind": "build_request",
  "title": "Add splash page for TV Streaming Network",
  "projectName": "TV Streaming Network",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a splash page that appears on first app load and prominently displays the text \"TV STREAMING NETWORK\" before the user reaches the existing Home view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can I add a splash page TV STREAMING NETWORK"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load, the splash page is shown before the existing Home view content (Hero + video rows).",
        "The splash page includes the exact visible title text: \"TV STREAMING NETWORK\".",
        "The existing Home view remains available and unchanged once the user proceeds past the splash page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide a clear action on the splash page to continue into the app (navigate to the existing Home view) and ensure the splash page does not block access to admin sign-in and the Manage Videos view once the user continues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can I add a splash page TV STREAMING NETWORK"
        ]
      },
      "acceptanceCriteria": [
        "The splash page contains a clearly labeled continue action (e.g., a button) that transitions to the existing Home view.",
        "After continuing, the existing TopNav is visible and the user can use Admin Sign In and, if authorized, access Manage Videos as before.",
        "No admin-gating logic is weakened: Manage Videos remains restricted to admins only (same behavior as current app)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the app’s view/state flow to support a new initial \"splash\" view and hide the existing TopNav while the splash page is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can I add a splash page TV STREAMING NETWORK"
        ]
      },
      "acceptanceCriteria": [
        "When the splash page is active, the TopNav is not rendered.",
        "When the user continues, the app transitions to the existing Home view and TopNav renders normally.",
        "Refreshing the page while on the splash page still shows the splash page until the user continues."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn UI components must be composed, not modified).",
    "Do not modify immutable hook entrypoints (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains a single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Do not change the existing admin code/PIN (\"Security777\") behavior.",
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not redesign the existing Home view content structure beyond what is necessary to introduce the splash page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}