{
  "kind": "build_request",
  "title": "Make admin dashboard visible after entering login code Security777",
  "projectName": "TV Streaming Network",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Ensure the admin login code \"Security777\" grants admin access for the currently signed-in Internet Identity session, so the admin dashboard (Manage Videos view) becomes visible and accessible.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "i don't see dashboard. make dashboard appear login code  Security777"
        ]
      },
      "acceptanceCriteria": [
        "When a user is signed in with Internet Identity and enters the admin token exactly \"Security777\" in the Admin Sign In dialog, `useIsAdmin()` resolves `isAdmin=true` without requiring a page refresh.",
        "After admin access is granted, the top navigation shows the admin dashboard entry (currently labeled “Manage Videos”).",
        "After admin access is granted, the user can navigate to the Manage Videos view and see the management UI (Add/Edit/Delete).",
        "When an incorrect token is entered, admin access is not granted and the dashboard entry remains hidden/disabled, with a clear English error message."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Make the dashboard discoverable by improving the post-admin-login UX: after successfully applying a valid admin token, automatically direct the user to the admin dashboard view (Manage Videos) and confirm access in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "i don't see dashboard. make dashboard appear login code  Security777"
        ]
      },
      "acceptanceCriteria": [
        "After the user applies a valid admin token and admin status becomes true, the app navigates to the Manage Videos view automatically.",
        "If admin status does not become true (e.g., wrong token), the app does not navigate and remains on the current view.",
        "All user-facing messages remain in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Keep all Motoko backend logic in the single actor in backend/main.mo; only add/modify migration.mo if a stable-state upgrade is required."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; Internet Identity remains the only user authentication method.",
    "Do not add real-time features (WebSockets/chat).",
    "Do not introduce external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}